* TODO diff of distinct endpoints  between testruns
  We have a script now, =scripts/gatherendpoints.json= that loops through our known testruns and writes all the endpoints to file.
  We can now do a diff between the various testruns.
  
  #+NAME: our endpoints
  #+BEGIN_SRC shell :dir ../scripts/gathered_endpoints
  ls
  #+END_SRC

  #+RESULTS:
  #+begin_EXAMPLE
  1134962072287711234.json
  1141017488889221121.json
  1145963446211186694.json
  1152045379034812417.json
  #+end_EXAMPLE
  
** 1134962072287711234 + 1141017488889221121
  1134962072287711234 timestamp: "2019-06-01T23:40:05.456368+00:00"
  1141017488889221121 timestamp: "2019-06-18T16:52:03.781229+00:00"
  
  #+NAME: diff between 1134962072287711234 and 1141017488889221121
  #+BEGIN_SRC shell :dir ../scripts/gathered_endpoints :results output
    pwd
    ls
    wc -l 1134962072287711234.json
    wc -l 1141017488889221121.json
    diff 1134962072287711234.json 1141017488889221121.json
  #+END_SRC

  #+RESULTS: diff between 1134962072287711234 and 1141017488889221121
  #+begin_EXAMPLE
  #+end_EXAMPLE

